Repository: mohamedakeel0/ewasfa
Catalog: lib/assets/lang/l10n/app_*.arb
Languages: ar

source: Hello World!
ar: مرحباً بالعالم!

source: Home Page
ar: الصفحة الرئيسية

source: Home
ar: الرئيسية

source: Home Screen
ar: شاشة الرئيسية

source: Order History
ar: سجل الطلبات

source: Notifications
ar: الإشعارات

source: Settings
ar: الإعدادات

# addNewAddress
source: Add a New Address
ar: إضافة عنوان جديد

# addressAddedMsg
source: Address Added Successfully.
ar: تمت إضافة العنوان بنجاح

# addressUpdatedMsg
source: Address Updated Successfully.
ar: تم تعديل العنوان بنجاح

# addressDeletedMsg
source: Address Deleted Successsfully.
ar: تمت إزالة العنوان بنجاح

source: Address Book
ar: سجل العناوين

source: My Addresses
ar: عناويني

source: Enter Value
ar: أدخل القيمة

source: Offer ends
ar: تنتهي العرض في

# offerPrice
source: Price in Offer
ar: سعر العرض

source: More Details
ar: المزيد من التفاصيل

source: System Language
ar: لغة النظام

source: Language
ar: اللغة

source: Theme
ar: ثيم الألوان

# notificationToolTip
source: Control your Notification Settings
ar: تحكم في إعدادات الإشعارات

# themeToolTip
source: Select your preferred color theme
ar: اختر ثيم الألوان المفضل لديك

source: Prescriptions History
ar: سجل الروشتات

# languageToolTip
source: Select your preferred language
ar: اختر اللغة المفضلة لديك

source: Order ID
ar: رقم الطلب

source: Order Status
ar: حالة الطلب

# reviewOrder
source: Review your order
ar: فضلا راجع طلبك

source: endDate
ar: تاريخ الانتهاء

source: First Name
ar: الاسم الأول

source: Last Name
ar: الاسم الأخير

source: My Profile
ar: ملفي الشخصي

# phone
source: Phone Number
ar: رقم الهاتف

source: Password
ar: كلمة المرور

source: E-Mail
ar: البريد الإلكتروني

source: Offers & Promotions
ar: العروض والترويجات

source: Pharmacy Offers
ar: عروض الصيدلية

source: Clinic Offers
ar: عروض العيادات

# genericError
source: An Error Occurred!
ar: حدث خطأ!

# okayMsg
source: Okay
ar: موافق

# authenticationFailedError
source: Authentication Failed! Please try again later!
ar: فشلت عملية المصادقة! يرجى المحاولة مرة أخرى في وقت لاحق!

# phoneInUseError
source: This phone number is already in use!
ar: رقم الهاتف هذا مستخدم بالفعل!

# invalidPhoneError
source: This is not a valid Phone Number!
ar: هذا ليس رقم هاتف صالح!

# weakPasswordError
source: This password is too weak!
ar: كلمة المرور ضعيفة جداً!

# wrongPasswordError
source: Wrong Password! Please try again
ar: كلمة المرور غير صحيحة! حاول مجددا

# invalidPasswordError
source: Invalid password!
ar: كلمة مرور غير صالحة!

# enterCodeError
source: Please enter the code
ar: يرجى إدخال الكود

source: Confirm Password
ar: تأكيد كلمة المرور

source: Remember Me
ar: تذكرني

source: Login
ar: تسجيل الدخول

source: Log out
ar: تسجيل الخروج

source: Sign Up
ar: إنشاء حساب

# addressLine
source: Address
ar: العنوان

# landmark
source: Location Landmark
ar: علامة مميزة

# city
source: City of Residence
ar: مدينة الإقامة

source: Select Location
ar: اختر العنوان من الخريطة

source: Select Location to proceed
ar: إختر العنوان من الخريطة أولا للإستمرار

source: Use Location Data
ar: إستخدم بيانات الموقع

source: Directions
ar: الإتجاهات

source: Directions to Branch
ar: الإتجاهات إلى الفرع

source: far
ar: على بعد

# kilometers
source: km
ar: كم

source: Submit
ar: إرسال

source: Referred Order
ar: طلب معد مسبقا

# enterCode
source: Enter the Referral Code
ar: أدخل رمز الطلب بالرسالة الواردة

source: Recurring Order
ar: طلب متكرر

# selectOrder
source: Select a previous Order to reorder
ar: حدد طلبًا سابقًا لإعادة الطلب

# placeOrder
source: Place an Order
ar: قم بالطلب

# placeNewOrder
source: Place a new Order
ar: قم بطلب جديد

source: Place another Order
ar: قم بطلب آخر

# goToHome
source: Go to Home Screen
ar: الانتقال إلى شاشة الرئيسية

source: New Order
ar: طلب جديد

# orderSuccessMsg
source: Your order has been accepted and is being processed.
ar: تم قبول طلبك ويتم مراجعته.

# orderSuccess
source: Order Successful
ar: طلب ناجح

# orderFailedMsg
source: Sorry, your order failed to process.
ar: عذرًا، فشل طلبك في المعالجة.

source: Order Failed
ar: فشل الطلب

source: Try Again
ar: حاول مرة أخرى

# phone_number_label
source: Phone Number
ar: رقم الهاتف

# first_name_label
source: First Name
ar: الاسم الأول

# last_name_label
source: Last Name
ar: الاسم الأخير

# email_label
source: Email
ar: البريد الإلكتروني

# gender_label
source: Gender
ar: الجنس

# password_label
source: Password
ar: كلمة المرور

# confirm_password_label
source: Confirm Password
ar: تأكيد كلمة المرور

# remember_me_label
source: Remember me
ar: تذكرني

# password_too_short_error
source: Password is too short!
ar: كلمة المرور قصيرة جدًا!

# passwords_do_not_match_error
source: Passwords do not match!
ar: كلمات المرور غير متطابقة!

# login_button_label
source: LOGIN
ar: تسجيل الدخول

# signup_button_label
source: SIGN UP
ar: إنشاء حساب

# login_instead_button_label
source: LOGIN INSTEAD
ar: قم بتسجيل الدخول بدلاً من ذلك

# home_screen_title
source: Promotions & Offers
ar: العروض والتخفيضات

source: Pharmacy Offers
ar: عروض الصيدلية

source: Clinics Offers
ar: عروض العيادات

source: Offer Information
ar: معلومات العرض

source: Offer valid until
ar: العرض ساري حتى

source: Price Before
ar: السعر قبل

source: Price After
ar: السعر بعد

source: Control your notification settings
ar: تحكم في إعدادات الإشعارات

source: Push notifications
ar: الإشعارات الفورية

source: Email notifications
ar: إشعارات البريد الإلكتروني

source: Select your preferred language
ar: اختر اللغة المفضلة لديك

source: Sub-options for language
ar: الخيارات الفرعية للغة

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Select your preferred color theme
ar: اختر سمة الألوان المفضلة لديك

source: Sub-options for theme
ar: الخيارات الفرعية للسمة

source: Light
ar: فاتح

source: Dark
ar: داكن

source: Sub-options for notifications
ar: الخيارات الفرعية للإشعارات

source: Prescription Description
ar: تفاصيل الروشتة

source: EnterPrescription Description
ar: أدخل تفاصيل الروشتة

source: Submit Order
ar: إرسال الطلب

source: Back
ar: العودة

source: Please, enter patient name
ar: فضلا أدخل اسم المريض

source: Enter patient name
ar: فضلا أدخل اسم المريض

source: Patient Name
ar: إسم المريض

source: Patient Phone Number
ar: رقم جوال المريض

# enterPatientNumber
source: Enter patient phone number
ar: أدخل رقم جوال المريض

source: Make Doctor Order
ar: عمل طلب كدكتور

source: Camera
ar: الكاميرا

source: Gallery
ar: الصور

source: Select Source
ar: إختر مصدر الصور

source: Doctor Order
ar: طلب كدكتور

source: Doctor Name
ar: إسم الدكتور

source: Promocode
ar: كود البرومو

source: Pick From Store
ar: الإستلام من الصيدلية

source: Delivery
ar: التوصيل

source: Success
ar: عملية ناجحة

# otpSuccessful
source: OTP verification successful!
ar: OTP تعريف ناجح!

# otpfailed
source: OTP verification failed. Please try again!
ar: فشل. يرجى المحاولة مرة أخرى OTP تعريف ال!

# offerinfo
source: Offer Information
ar: تفاصيل العرض

# offerValidity
source: Offer Valid until
ar: العرض ساري حتى

source: Date
ar: التاريخ

source: Price
ar: السعر

# orderInfo
source: Order Information
ar: تفاصيل الطلب

# prescriptionImage
source: Prescription Images
ar: صور الروشتة

source: Cancel
ar: إلغاء

source: Choose Address
ar: إختيار العنوان

# noImageErrorMsg
source: No images were picked. Please pick 1 image at least.
ar: لم يتم اختيار أي صور. يُرجى اختيار صورة واحدة على الأقل.

# verifyPhoneError
source: Your phone needs to be verified!
ar: سيتم تحويلك لصفحة تأكيد رقم الجوال

# addPrescription
source: Click on the + above to add a Prescription image
ar: إنقر على علامة ال + لإضافة صور الروشتة

# selectAddressBranch
source: Choose an address or a branch to complete your order
ar: إختر عنوانك أو الفرع الذي تود الإستلام منه لإكمال طلبك

# noBranchesMsg
source: No Branches Data
ar: لا يوجد فروع

source: Forgot Password
ar: نسيت كلمة السر

source: Reset Password
ar: إعادة ضبط كلمة السر

# phoneEmptyMsg
source: Please enter a valid Phone Number
ar: أدخل رقم الجوال

# passwordEmptyMsg
source: Please enter password
ar: أدخل كلمة السر

# emailEmptyMsg
source: Please enter email
ar: أدخل البريد الإلكتروني

# emailFormatMsg
source: Please enter valid email
ar: أدخل بريد الإلكتروني صحيح

# genderEmptyMsg
source: Please enter gender
ar: أدخل الجنس

# fnameEmptyMsg
source: Please Enter First Name
ar: أدخل الإسم الأول

# lnameEmptyMsg
source: Please Enter Last Name
ar: أدخل إسم العائلة

source: Female
ar: أنثى

source: Male
ar: ذكر

source: Confirm Delete
ar: تأكيد الحذف

# sure_delete
source: Are you sure you want to delete this address?
ar: هل أنت متأكد أنك تريد حذف هذا العنوان؟

# sureDeleteAccount
source: Are you sure you want to delete this account?
ar: هل أنت متأكد من حذف هذا الحساب

source: Delete Account
ar: حذف الحساب

# notExistAccErrMsg
source: This account does not exist!
ar: لا يوجد حساب بهذا الرقم

source: Delete
ar: حذف

source: None
ar: لا يوجد

# guestLogin
source: Login as guest
ar: الدخول كضيف

# guestError
source: You need to be logged in to perform this action!
ar: يجب أن تسجل الدخول للقيام بهذه العملية

# pro_description
source: Prescription Description
ar: تفاصيل الطلب

source: Order Notes
ar: ملاحظات الطلب

# enterOTP
source: Please enter the 5 digit OTP that you received via SMS
ar: SMSالمكون من 5 أرقام الذي تم إرساله عبر الOTPمن فضلك أدخل

source: Send
ar: ارسال

# otp
source: Enter Otp
ar: ادخل الكود

source: New Password
ar: ادخل البسورد

# title_forget
source: Please wait, we will send you an SMS message to verify your account.
ar: . برجاء الإنتظار، سوف نرسل لك رسالة نصية للتحقق من حسابك

source: Don't have an account?
ar: ليس لديك حساب؟
